{"data":{"site":{"siteMetadata":{"title":"thefrvrplaylist","subtitle":"Written and curated by Martin Manasherob, professionally known as mvrtinfrvr, a singer/songwriter, record producer, and audio engineer from the Bay Area, California.","copyright":"© FRVRSZN","menu":[{"label":"articles","path":"/"},{"label":"current rotation","path":"/playlist"},{"label":"about me","path":"/about"}],"author":{"name":"thefrvrplaylist","email":"thefrvrplaylist@gmail.com","instagram":"mvrtinfrvr","twitter":"mvrtinfrvr","linkedin":"manasherob","soundcloud":"mvrtinfrvr","nextEP":"www.hyperurl.co/poeapy"}}},"markdownRemark":{"id":"904a0207-e099-547f-81fc-291fd878b227","html":"<p>My name is Martin Manasherob, and I’m a 20-year old artist from the Bay Area, California. I began working on music at the age of 14, but didn’t begin taking things seriously until I was a 17-year old high school senior. Since then, I’ve been exclusively producing all of my music, writing and recording it myself, and then mixing and mastering it in order to release it.</p>\n<p>I am a full time Honors student at the same time, majoring in business administration. I work part time as a repair technician, working on computers and phones, and am beginning streetwear company that I am looking to launch within the next few months. I love keeping myself busy and setting new goals for myself to accomplish, as these keep me motivated day-to-day.</p>\n<p>I can talk about music 24/7, so it only felt appropriate that I began this blogging adventure! I intend for thefrvrplaylist to become a go-to spot for discovering new music, as I have found that I am my friend’s first person they go to when looking for something new and fresh to listen to. I would love for people to send me suggestions, as this blog will be centered around written and video reviews, music playlists, and sharing of my own original releases.</p>\n<p>My favorite genre is R&#x26;B, with hip-hop coming a close second. My favorite artists at the moment are Kanye, Tory Lanez, Jacquees, The Weeknd, Bryson Tiller, Trey Songz, Young Thug, Migos, Jhene Aiko, Big Sean, JAY Z, Meek Mill, Ty Dolla $ign, Omarion, Usher, Travis Scott, and PARTYNEXTDOOR. I’m looking to discover new artists to listen to, so please send suggestions!</p>\n<p>Check out my social media and music links in the sidebar to the left to connect with me!</p>\n<p>Enjoy!</p>","frontmatter":{"title":"About Me","date":null,"description":null}}},"pageContext":{"slug":"/about"}}