{"data":{"site":{"siteMetadata":{"title":"thefrvrplaylist","subtitle":"Written and curated by Martin Manasherob, professionally known as mvrtinfrvr, a singer/songwriter, record producer, and audio engineer from the Bay Area, California.","copyright":"© FRVRSZN","author":{"name":"thefrvrplaylist","email":"thefrvrplaylist@gmail.com"},"disqusShortname":"","url":"https://thefrvrplaylist.com"}},"markdownRemark":{"id":"a02ffa0d-accb-5c45-8e7f-99e6a5b81acd","html":"<p>It’s been a while, I’ll admit. This blog was something I intended to post to bi-weekly, perhaps even weekly. But life gets in the way, as I’m sure we all have experienced. To be quite honest, this might be the busiest I have ever been. And I make that statement with some resentment, as I can count the excessive amount of free time I have that I waste, whether it be with video games or watching irrelevant videos on YouTube. I know a break is necessary, but this isn’t exactly what I had in mind when I created thefrvrplaylist with my best friend.</p>\n<p>Let me explain. I’m at a point in life where everything is still up for grabs and therefore there are things I need to prioritize. I am also at a point where I feel as though I am super close to achieving validation for the time I point into things. And at this point, thefrvrplaylist is something I know I don’t have to do. It’s not a source of income, and it’s not related to my education. It’s a hobby. Nevertheless, I have neglected it for too long and am hoping to begin to change that.</p>\n<p>But I have my days. One day school will kick my ass. 25 units. Calculus is hard as shit. I wish it were English or something, life would be easy as fuck. But it’s not. And work has been extremely repetitive and dry the past few months as well. With that said, I’ll come home after a day filled with the challenges of these spectrums and won’t do anything but bullshit. It’s already April, and my EP still isn’t out. Fuck.</p>\n<p>I want to put it out this month though. Fingers are crossed. But with that being said, I find myself back here. I don’t want everything on here to just be about music. I don’t think that there are many people in my life I regularly have deep conversations with, but that is a choice I make. I guess I want to be open about how life is going on here too, or at least provide explanation as to where I’ve been these past few months. I’m aware there’s not many of you reading, but maybe I am just using this as a way to write my thoughts down for my own sake.</p>\n<p>Anyway, it’s my last quarter at my community college before I transfer to a university, and the admission decisions for the schools I consider my top choices are coming out next week. I go in and out of moments where I can’t think about anything other than these life-changing decisions. My coworkers can attest to how I only talk about this subject my whole time at work. With that being said, I am looking for anything to keep myself busy and off that topic, as things are out of my control at this point. I understand that, but I just have to keep reminding myself.</p>\n<p>Nevertheless, my short term goals: Finish mixing and mastering my EP (that process has been such a bitch); post a new and relevant review for a newly-released project. I was waiting to make my ‘comeback’ with the Offset album, which I was extremely excited for, but never got around to doing it. It was pretty solid, if you’re wondering. I think at this point, the next thing on my plate regarding thefrvrplaylist is to list albums I am looking forward to this year that have yet to come out. That will be a good place to start.</p>\n<p><em>What I’m Currently Listening To: “A” by Usher x Zaytoven. Extremely underrated project that has been the only thing I’ve been playing the last few days!</em></p>","fields":{"tagSlugs":["/tags//"]},"frontmatter":{"title":"it's been a while","tags":[""],"date":"2019-04-12T16:30:00.000Z","description":"A list of my 10 favorite songs this year."}}},"pageContext":{"slug":"/posts/its-been-a-while/"}}