{"data":{"site":{"siteMetadata":{"title":"thefrvrplaylist","subtitle":"Written and curated by Martin Manasherob, professionally known as mvrtinfrvr, a singer/songwriter, record producer, and audio engineer from the Bay Area, California.","copyright":"© FRVRSZN","author":{"name":"thefrvrplaylist","email":"thefrvrplaylist@gmail.com"},"disqusShortname":"","url":"https://thefrvrplaylist.com"}},"markdownRemark":{"id":"c4a23482-f32d-589b-8ce7-6a0abf78efae","html":"<p>A list of my 10 favorite songs this year, and while the top 5 is solid in terms of how I rank them, 6-10 gets a bit more interchangeable and was the hardest order to decide. Enjoy.</p>\n<p><strong>10. “I Was Never There” - The Weeknd (feat. Gessafelstein)</strong></p>\n<p>The Weeknd’s March EP My Dear Melancholy, took some time to grow on me. It wasn’t that it was bad music, but the hype surrounding it and the talk about how it was similar to Trilogy was kind of funny to me; I don’t think this sounds like his older work at all. This EP is full of 808’s and hi-hats, and it better compares to his last album Starboy or Bryson Tiller’s T R A P S O U L. Nonetheless, I revisited it a few months ago, and this is the standout track for me. There isn’t much writing on the whole project, as the hooks repeat, but are changed with different effects and more reverb and echo. However, this track features a really clean breakdown where The Weeknd has another brilliant moment on the back half of the track. Hell, even Meek Mill sampled this song on his Championships album closer, “Cold Hearted II”.</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 126.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://open.spotify.com/embed/track/5rgnyXr2PXFWsAnPFew077\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p><strong>9. “You” - Jacquees</strong></p>\n<p>This is a hit, and people are only starting to catch on now. It’s an old school R&#x26;B track that has Quees lamenting that while his significant other adds drama to his life, he’d “rather be with [her] and all [her] bullshit” than alone. This is a slow-jam that showcases his ability to have vocally been a superstar 20 years ago just as much as today. It’s simply smooth. The electric piano is very soothing and this is definitely a song that will put you to sleep (in a good way!). This could have been much higher on the list if it was released as a single sooner, as people are only beginning to see his talent now. While he does make controversial statements regarding his status, Jacquees has the best voice in the game right now and that is an opinion I firmly stand behind.</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 126.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://open.spotify.com/embed/track/01jIO8SJFnpSiNLH1JaBZ5\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p><strong>8. “NICE” - The Carters</strong></p>\n<p>JAY Z &#x26; Beyonce dropped their surprise collab and surprisingly it didn’t garner much attention, debuting at #2 on the Billboard 200 for top albums (while that may seem high, I can’t remember the last time they did not debut at #1 for their individual albums). In my opinion, Beyonce did too much rapping when she has one of the best singing voices in music, and the music overall seemed like they wanted to ride other artists’ waves (see “Migos”). This song makes the list not for either Jay or Bey’s performance on it, but rather the beat selection. Pharrell gifted them the ‘NICE’ beat which goes crazy; the sub bass is bouncy, the clap used for the snare is crisp, and the hi-hat pattern moves you. The hook, despite its childish and repetitive nature, is just catchy enough, and this song slides into the list. You can thank Pharrell.</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 126.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://open.spotify.com/embed/track/44lusH2vzc4sRAwsooRhPh\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p><strong>7. “TAlk tO Me” - Tory Lanez (with Rich the Kid)</strong></p>\n<p>The first single from Lanez’s second album of 2018, “TAlk tO Me” is a song that sounds very similar to one coming up soon on this list, and for that reason, it felt a bit lazy to me when it dropped. The hook could have been better, and while I think the song isn’t anything crazy in terms of writing or content, there was just something that kept bring me back. It’s almost like you hear this song and even if you don’t like it much, you can’t help but yell, “TAlk tO Me bAbY!!” out loud. This song grew on me, and while I am not a huge Rich the Kid fan, the track helped me see why people enjoy his music. While he does mumble, there’s a certain energy about his verse that just makes it a  V I B E. </p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 126.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://open.spotify.com/embed/track/2cRgo1TiPm7SnPvYzvbOLf\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p><strong>6. “London” - Jacquees</strong></p>\n<p>There are a lot of songs on this list that had to grow on me for me to enjoy them, and this track right here is the definition. This is a song I used to skip almost every time it popped up, but when the music video came out I gave it another chance, and my mind completely changed. It’s smooth, romantic, and definitely makes you immediately think of someone specific that means something special to you when it comes on. The track itself is a bit long which I think held it back from being a hit song, but it is still an old school R&#x26;B track that I genuinely love. </p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 126.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://open.spotify.com/embed/track/0R9w1IvhD58wy452REwgPf\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p><strong>5. “B.I.D.” - Tory Lanez</strong></p>\n<p>A super flowy, swaggery, summer song. This track is less than three minutes long and was constantly on repeat this whole summer for me. It’s fast-paced, it’s fun, and it isn’t trying to do too much. This track showcases Tory rapping in his confident nature yet incorporating singing elements into the hook. This song makes you want to live like Tory, who boasts about making “20 motherfucking racks, on a bad day,” because that sounds nice as shit. This song had potential to be a huge hit, and I think the fact Lanez released it as a promo single instead of a lead single definitely held it back. Honorable mention: Lanez’s track “Shooters” would have maybe even grabbed the top spot on this list, however it was released in late 2017, despite his Memories Don’t Die album dropping this year. I can listen to that track back-to-back-to-back-to-back-to-ba…</p>\n<p>Quotables: “Jumped in the ‘what-the-fuck-is-that?’ /Drunk and it ain’t no coming back.”</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 126.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://open.spotify.com/embed/track/6dnrppGRbt8fie18Lcd9Dd\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p><strong>4. “No Drama” - Tinashe (feat. Offset)</strong></p>\n<p>The first single from Tinashe’s new Joyride album dropped at the beginning of the year, and this is one of the most underrated tracks this year. The beat is a haunting trap banger, and there’s something so satisfyingly dark about it. Showcasing her swagger, Tinashe flaunts her success, beauty, and her lifestyle in general in the song’s lyrics. It’s clearly a single, but she doesn’t dumb it down too heavily, and the sentiment is still poignant. And I’ll be honest, “they said I’m falling off but they won’t JFK me,” is hard as fuck. The chorus is very catchy, and I’m surprised this track wasn’t all over the charts, although it makes some sense given the lack of push she gets from her label, who she is seeking separation from. Migos’ Offset comes through was a ton of energy on the guest verse and ad-libs throughout the track, one of the elements that maintains the track’s energy on 10 throughout, and with Offset having a scorching hot year with his tracks and features, this song easily should have been a hit. Regardless, this was still a huge win in my book.</p>\n<p>Quotables: “Mobbin’ through the hills, pulled up with my crew. /I can’t cop the coupe, don’t do shit for two. /Said I’m falling off but they won’t JFK me. /Tried to be myself but they won’t AKA me. /AKA a popstar, AKA a problem.”</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 126.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://open.spotify.com/embed/track/3doVAxeH3SgWtlRMqR4eLi\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p><strong>3. “WIN” - Jay Rock</strong></p>\n<p>An anthem in every sense of the word; a smash. Jay Rock knew what he was doing with this one. He’s had a huge year, with other hit songs such as King’s Dead, and Rock, who I have thoroughly enjoyed listening to since his street album 90059 released during my senior year of high school in late 2015, put together a winning (no pun intended) formula. Powerful, motivational horns are partnered with sixteenth-note and triplet hi-hats in order to produce a motivational trap banger that has been plenty used for NBA commercials and commercial soundtracks alike since its summer release. Having already anticipated new Rock music for almost 3 years since his last album, I found the biggest speaker I could connect to at work at the exact moment this song came out and turned the volume all the way up; I was not disappointed then, and I especially was not disappointed watching Rock perform this live during his October tour this past year, when he used this track as his encore as well. It is a true anthem that I can honestly admit has lifted my spirits and kept me focused on my ambitions numerous times. </p>\n<p>Quotables: “Win, win, win, win. /Fuck everything else! /Win, win, win, win. /Stop chasing that bitch!. /Win, win, win, win.”</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 66.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://open.spotify.com/embed/track/6zaywrggIpaM7Ghgvgjb8R\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p><strong>2. “If You Know You Know” - Pusha T</strong></p>\n<p>The opening track to Pusha T’s trail-blazing “Daytona” is the best produced track of the year. Produced by my personal favorite artist of all time, Mr. Kanye West, the track begins with Push rapping over a hi-hat for the first 40 seconds, only to have an anthemic sample and a powerful sub-bass knock through and set the tempo for G.O.O.D. Music’s 5 album run in May and June of this year. Everything about this song is an anthem; the sample, taken from the 1972 song “12 O’Clock Satanial”, which showcases West’s sampling reach as it was released more than 5 years prior to West or Push being born; or maybe it’s the repeating, ‘if you know you know’ chorus that has Push questioning who really knows about the coke game like he does. Push explained the song’s lyrics on a Genius episode, which explained so many of the drug innuendos I could never even begin to think about in the lyrics. I recall watching NBA superstar Steph Curry warming up to this song in a huge arena and only then realized the magnitude of this anthem; and as someone who went to the Daytona World Tour this past November, you can only imagine how my belief was validated watching this performed live. For months, this song held my #1 spot, but my inability to relate to it places it at #2.</p>\n<p>Quotables: “When we all clickin’ (cliquing) like Golden State, /And you and your team are the motorcade? /…I’ve been hiding where you can see me, /The skybox is right next to RiRi’s.”</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 126.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://open.spotify.com/embed/track/6bGwKHXHNLmTy6yt147FPh\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p><strong>1. “23” - Jacquees</strong></p>\n<p>Jacquees &#x26; Donell Jones partner up to write my favorite song of 2018. It is smooth, well-written, and perfectly executed. 23 is an old-school slow jam where Jacquees uses his versatile vocal range to counteract the playboy-ish nature of his lyrics. Donell Jones, who also produced the song, penned the track from Quees’ perspective, explaining the nature of his young stardom and his inability to settle down at his youthful age. This is a track that got me into Jones’ music, who was a bonafide R&#x26;B star in the late 90’s and early 2000’s, and the themes and styling of this track definitely align with his sound. There’s not much else I can say about this track; I even covered it (<a href=\"https://soundcloud.com/mvrtinfrvr/twenty3\">https://soundcloud.com/mvrtinfrvr/twenty3</a>). This would have been a smash 15 years ago, and despite its old-school, less than modern production, it lands at #1 on my favorite songs of 2018. Had Cash Money marketed this specific track more, it would have made some waves, no doubt in my mind. </p>\n<p>Quotables: “When I’m ready for love, it’s gon’ be real love. /I’mma give her what she needs. /I feel that I’m too young to settle down, /That’s just the player in me.”</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 126.66666666666666%; position: relative; height: 0; overflow: hidden;margin-bottom: 1.0725rem\"\n          >\n            <iframe src=\"https://open.spotify.com/embed/track/4L8sddbw6nceYHWOgdcAXf\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p>Honorable Mentions:\n“Open It Up” - Migos - One word: Energy\n“Studio” - Jacquees (feat. Young Thug) - A hit, plain and simple. Jacquees and Jeffery have great chemistry. Almost cracked the top 10.\n“Rose In Harlem” - Teyana Taylor - Teyana talking her shit, like the boss she is.\n“Boo’d Up” - Ella Mai - An anthem. I’m convinced guys like this even more than girls. Her song “Good Bad” could also be here.\n“Trip” - Ella Mai/Jacquees - We all know which version we like better.\n“On the Run” - Young Thug (feat. Offset) - Fun, energetic, entertaining. Neither rappers disappoint on this track.</p>\n<p>The Top 5 Albums of 2018 List is coming up next!</p>","fields":{"tagSlugs":["/tags/2018-year-end-lists/"]},"frontmatter":{"title":"top 10 songs of the year","tags":["2018 Year-End Lists"],"date":"2018-12-31T16:30:00.000Z","description":"A list of my 10 favorite songs this year."}}},"pageContext":{"slug":"/posts/top-10-songs-of-2018/"}}