{"data":{"site":{"siteMetadata":{"title":"thefrvrplaylist","subtitle":"Written and curated by Martin Manasherob, professionally known as mvrtinfrvr, a singer/songwriter, record producer, and audio engineer from the Bay Area, California.","copyright":"© All rights reserved.","author":{"name":"thefrvrplaylist","twitter":"mvrtinfrvr"},"disqusShortname":"","url":"https://thefrvrplaylist.com"}},"markdownRemark":{"id":"a3b8a3c0-fb93-51cf-a89f-ec40dcf24fef","html":"<p>Welcome to thefrvrplaylist! My name is Martin, and for several years now, I have been recording, producing, and engineering my own original music. I felt a strong connection to music around the age of 10, when I began playing the alto saxophone and clarinet in my school band. Music had a special way to uplift my spirits, and a few years later, I began creating my own, originally favoring hip-hop but later finding my lane with R&#x26;B music, which is now my favorite genre.</p>\n<p>More recently, I have discovered the passion I have for music is deeper than just creating it. During my free time, when I am not working on my own music, in class achieving my bachelor’s degree in business, at work, where I am a computer repair technician, or working on designing original clothes, I am listening to music. I found that I can talk about music I am into for days, and with the help of my best friend, I decided to create this blog where I will be reviewing new music, showcasing my favorite albums I’m listening to, and just sharing music I like in general. Please feel free to send me recommendations at my email!</p>\n<p>Enjoy!</p>\n<p>Written by Martin Manasherob, who is currently based in the Bay Area. You can connect with him on instagram.</p>","fields":{"tagSlugs":["/tags/gatsby/","/tags/web-development/"]},"frontmatter":{"title":"A New Chapter","tags":["Gatsby","Web Development"],"date":"2018-10-18T16:51:00.000Z","description":"Welcome to thefrvrplaylist! My name is Martin, and for several years now, I have been recording, producing, and engineering my own original music. I felt a strong connection to music around the age of 10, when I began playing the alto saxophone and clarinet in my school band. Music had a special way to uplift my spirits, and a few years later, I began creating my own, originally favoring hip-hop but later finding my lane with R&B music, which is now my favorite genre."}}},"pageContext":{"slug":"/posts/upgraded-to-gatsby-v2/"}}